In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('hp.csv')
df.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [3]:
dummies = pd.get_dummies(df.town)

In [4]:
dummies.head()

   monroe township  robinsville  west windsor
0                1            0             0
1                1            0             0
2                1            0             0
3                1            0             0
4                1            0             0

In [36]:
data = pd.concat([df, dummies], axis='columns')

In [37]:
data.head()

              town  area   price  monroe township  robinsville  west windsor
0  monroe township  2600  550000                1            0             0
1  monroe township  3000  565000                1            0             0
2  monroe township  3200  610000                1            0             0
3  monroe township  3600  680000                1            0             0
4  monroe township  4000  725000                1            0             0

In [38]:
input = data.drop(['town'], axis='columns')
input.head()

   area   price  monroe township  robinsville  west windsor
0  2600  550000                1            0             0
1  3000  565000                1            0             0
2  3200  610000                1            0             0
3  3600  680000                1            0             0
4  4000  725000                1            0             0

In [39]:
target = input.price

In [40]:
input = input.drop(['price'], axis='columns')

In [41]:
input = input.drop(['monroe township'], axis='columns')

In [42]:
from sklearn import linear_model

In [43]:
reg = linear_model.LogisticRegression()

In [44]:
reg.fit(input, target)

LogisticRegression()

In [46]:
reg.predict([[2800, 1, 0]])

array([695000], dtype=int64)